package org.example.lesson1;

public class Main {
    /*
    1. Создать builder для класса Person со следующими полями: String firstName, String lastName, String middleName, String country, String address, String phone, int age, String gender.
    2. Описать ошибки в коде (см. задание в методичке) и предложить варианты оптимизации.
        - Интерфейсы имплементировать в Car, не в каждой машине. Проще код. Логичнее дерево наследования.
        - Не переопределен метод open в классе Lorry. Переопределить или убрать abstract и определить прямо в классе Car.
        - Lorry не имплементит интерфейсы, а экстендит.
        - Объект Engine не создан, но может это не ошибка, а просто код не дописан. Можно сделать его внутренним классом.
    3. Написать пример кода, который реализует принцип полиморфизма, на примере фигур — круг, квадрат, треугольник.
     */
}
